       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COUNTER PIC 9(2) VALUE 0.
       01  WS-DISPLAY PIC Z9.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "COUNTING TO 5:".
           PERFORM COUNT-PARA 5 TIMES.
           DISPLAY "DONE COUNTING".
           STOP RUN.
       COUNT-PARA.
           ADD 1 TO WS-COUNTER.
           MOVE WS-COUNTER TO WS-DISPLAY.
           DISPLAY "COUNT: " WS-DISPLAY.
